Here you go,

```
========================
Attempt: 5/5
/home/ubuntu/afsan/terraform apply  -var-file ../var.tfvars -input=false -auto-approve
========================
random_id.label[0]: Refreshing state... [id=XM4]
module.prepare.ibm_pi_network.public_network: Refreshing state... [id=8994821d-cdad-4df8-bf2b-d577a890ac24/12eebfea-aedf-4ca3-9f1a-dc28973b9b04]
module.nodes.ibm_pi_image.rhcos_image_import[0]: Refreshing state... [id=8994821d-cdad-4df8-bf2b-d577a890ac24/2cdf4de5-691d-4227-b972-cba897498aa7]
module.prepare.data.ibm_pi_catalog_images.catalog_images: Reading...
module.prepare.ibm_pi_key.key: Refreshing state... [id=8994821d-cdad-4df8-bf2b-d577a890ac24/rhcos-test-5cce-mon01-keypair]
module.nodes.data.ibm_pi_network.network: Reading...
module.prepare.data.ibm_pi_network.network: Reading...
module.nodes.data.ibm_pi_network.network: Read complete after 4s [id=d88e806b-48e8-49a7-86f5-32a25bd8dea8]
module.prepare.data.ibm_pi_network.network: Read complete after 4s [id=d88e806b-48e8-49a7-86f5-32a25bd8dea8]
module.prepare.data.ibm_pi_catalog_images.catalog_images: Read complete after 5s [id=2023-06-23 09:16:33.721294875 +0000 UTC]
module.prepare.data.ibm_pi_image.bastion[0]: Reading...
module.nodes.data.ibm_pi_image.rhcos: Reading...
module.nodes.data.ibm_pi_image.rhcos: Read complete after 4s [id=2cdf4de5-691d-4227-b972-cba897498aa7]
module.prepare.data.ibm_pi_image.bastion[0]: Still reading... [10s elapsed]
module.prepare.data.ibm_pi_image.bastion[0]: Read complete after 10s [id=2b40462f-fc19-40ae-bf5b-5f392df30256]
module.prepare.ibm_pi_volume.volume[0]: Refreshing state... [id=8994821d-cdad-4df8-bf2b-d577a890ac24/b9165249-fd08-410e-a2c5-17b493cde6e2]
module.prepare.ibm_pi_instance.bastion[0]: Refreshing state... [id=8994821d-cdad-4df8-bf2b-d577a890ac24/c6c63681-3604-416f-bcbb-b74fd08f2e9a]
module.prepare.data.ibm_pi_instance_ip.bastion_public_ip[0]: Reading...
module.prepare.data.ibm_pi_instance_ip.bastion_ip[0]: Reading...
module.prepare.data.ibm_pi_instance_ip.bastion_public_ip[0]: Read complete after 2s [id=12eebfea-aedf-4ca3-9f1a-dc28973b9b04]
module.prepare.null_resource.bastion_init[0]: Refreshing state... [id=1440999251745864916]
module.prepare.null_resource.bastion_register[0]: Refreshing state... [id=4964091146817620343]
module.prepare.null_resource.enable_repos[0]: Refreshing state... [id=6403457617226428554]
module.prepare.null_resource.bastion_packages[0]: Refreshing state... [id=7152637529665176252]
module.prepare.data.ibm_pi_instance_ip.bastion_ip[0]: Read complete after 2s [id=d88e806b-48e8-49a7-86f5-32a25bd8dea8]
module.prepare.null_resource.setup_nfs_disk[0]: Refreshing state... [id=2617456684439198402]
module.prepare.null_resource.rhel83_fix[0]: Refreshing state... [id=8111575135449011207]
module.nodes.data.ignition_file.w_hostname[1]: Reading...
module.nodes.data.ignition_file.b_hostname: Reading...
module.nodes.data.ignition_file.m_hostname[0]: Reading...
module.nodes.data.ignition_file.w_hostname[0]: Reading...
module.nodes.data.ignition_file.m_hostname[1]: Reading...
module.nodes.data.ignition_file.m_hostname[2]: Reading...
module.nodes.data.ignition_file.b_hostname: Read complete after 0s [id=57b7c553519fc6d30e8f7d244764f955e649a05fd7f543fa19083648acd57380]
module.nodes.data.ignition_file.m_hostname[2]: Read complete after 0s [id=91553045be20e1a9375a7dbc834741848049387a8398d88ddd3d6bbdcbc82256]
module.nodes.data.ignition_file.w_hostname[0]: Read complete after 0s [id=e168da8ba7c41aecf3551f313ae2b5b491b41c001a688dd60e0c9d51d4568d4f]
module.nodes.data.ignition_file.m_hostname[1]: Read complete after 0s [id=705215f73083a4ed320589c227ce0feac0157ddbb0ab5231af84130acbd0e21e]
module.nodes.data.ignition_file.m_hostname[0]: Read complete after 0s [id=8ea2e17a1169459f50115bbb84eedf5cf197a4a103e171d671e967c846de740c]
module.nodes.data.ignition_config.bootstrap: Reading...
module.nodes.data.ignition_file.w_hostname[1]: Read complete after 0s [id=25f468bda889a8a53d11ffa37a67f312f89951314f736a6c4defac98d2cf89cd]
module.nodes.data.ignition_config.master[2]: Reading...
module.nodes.data.ignition_config.master[0]: Reading...
module.nodes.data.ignition_config.master[1]: Reading...
module.nodes.data.ignition_config.master[1]: Read complete after 0s [id=3ad648c5aa89243fad43ff67f7b86e31b17a8dbb67da1ca33dbf17684f18f3f4]
module.nodes.data.ignition_config.worker[1]: Reading...
module.nodes.data.ignition_config.master[2]: Read complete after 0s [id=e9fd6bb72feff81d8f036dd570d77714dce359fd1a77a3047f3efa72cfa531b3]
module.nodes.data.ignition_config.worker[0]: Reading...
module.nodes.data.ignition_config.bootstrap: Read complete after 0s [id=3492659197935dee50cae13d840258d4d0aa5b1b9ebd56e97a3767db2b316cf7]
module.nodes.data.ignition_config.worker[1]: Read complete after 0s [id=cbc8c67dbb412527d56230aa5557fa77ae9a5df4f3455f2c2be761478582670c]
module.nodes.data.ignition_config.master[0]: Read complete after 0s [id=3868781462b2dda4e4b099d5f068f3cab07c41adc203c6d0e9df0c83db7a1f54]
module.nodes.data.ignition_config.worker[0]: Read complete after 0s [id=585a13957877dbe6daa039fffedb78fbee841cf8039cccc74887884e9a067458]
module.nodes.ibm_pi_instance.master[0]: Refreshing state... [id=8994821d-cdad-4df8-bf2b-d577a890ac24/de5e9981-1d4a-4bbd-9445-23c58147663d]
module.nodes.ibm_pi_instance.master[2]: Refreshing state... [id=8994821d-cdad-4df8-bf2b-d577a890ac24/f248c87d-60df-4438-8350-0301892547d4]
module.nodes.ibm_pi_instance.worker[1]: Refreshing state... [id=8994821d-cdad-4df8-bf2b-d577a890ac24/f2d3b070-aa32-4117-9bb6-90dc928b7834]
module.nodes.ibm_pi_instance.bootstrap[0]: Refreshing state... [id=8994821d-cdad-4df8-bf2b-d577a890ac24/a056cc0f-597d-49a3-a4cf-9ec734f5cd40]
module.nodes.ibm_pi_instance.master[1]: Refreshing state... [id=8994821d-cdad-4df8-bf2b-d577a890ac24/185567a0-05e6-4270-89d0-6ac58474baff]
module.nodes.ibm_pi_instance.worker[0]: Refreshing state... [id=8994821d-cdad-4df8-bf2b-d577a890ac24/0c236049-2105-4626-a672-7b082371280e]
module.nodes.ibm_pi_instance_action.bootstrap_stop[0]: Refreshing state... [id=8994821d-cdad-4df8-bf2b-d577a890ac24/a056cc0f-597d-49a3-a4cf-9ec734f5cd40]
module.nodes.data.ibm_pi_instance_ip.bootstrap_ip[0]: Reading...
module.nodes.null_resource.remove_worker[1]: Refreshing state... [id=5932284884708573259]
module.nodes.null_resource.remove_worker[0]: Refreshing state... [id=680223229490714701]
module.nodes.data.ibm_pi_instance_ip.worker_ip[0]: Reading...
module.nodes.ibm_pi_instance_action.worker_stop[1]: Refreshing state... [id=8994821d-cdad-4df8-bf2b-d577a890ac24/f2d3b070-aa32-4117-9bb6-90dc928b7834]
module.nodes.data.ibm_pi_instance_ip.worker_ip[1]: Reading...
module.nodes.ibm_pi_instance_action.worker_stop[0]: Refreshing state... [id=8994821d-cdad-4df8-bf2b-d577a890ac24/0c236049-2105-4626-a672-7b082371280e]
module.nodes.ibm_pi_instance_action.master_stop[1]: Refreshing state... [id=8994821d-cdad-4df8-bf2b-d577a890ac24/185567a0-05e6-4270-89d0-6ac58474baff]
module.nodes.data.ibm_pi_instance_ip.master_ip[0]: Reading...
module.nodes.ibm_pi_instance_action.master_stop[0]: Refreshing state... [id=8994821d-cdad-4df8-bf2b-d577a890ac24/de5e9981-1d4a-4bbd-9445-23c58147663d]
module.nodes.ibm_pi_instance_action.master_stop[2]: Refreshing state... [id=8994821d-cdad-4df8-bf2b-d577a890ac24/f248c87d-60df-4438-8350-0301892547d4]
module.nodes.data.ibm_pi_instance_ip.master_ip[1]: Reading...
module.nodes.data.ibm_pi_instance_ip.bootstrap_ip[0]: Read complete after 1s [id=d88e806b-48e8-49a7-86f5-32a25bd8dea8]
module.nodes.data.ibm_pi_instance_ip.master_ip[2]: Reading...
module.nodes.data.ibm_pi_instance_ip.worker_ip[0]: Read complete after 1s [id=d88e806b-48e8-49a7-86f5-32a25bd8dea8]
module.nodes.data.ibm_pi_instance_ip.worker_ip[1]: Read complete after 1s [id=d88e806b-48e8-49a7-86f5-32a25bd8dea8]
module.nodes.data.ibm_pi_instance_ip.master_ip[1]: Read complete after 1s [id=d88e806b-48e8-49a7-86f5-32a25bd8dea8]
module.nodes.data.ibm_pi_instance_ip.master_ip[0]: Read complete after 1s [id=d88e806b-48e8-49a7-86f5-32a25bd8dea8]
module.nodes.data.ibm_pi_instance_ip.master_ip[2]: Read complete after 1s [id=d88e806b-48e8-49a7-86f5-32a25bd8dea8]
module.install.null_resource.config: Refreshing state... [id=7507517030845147295]
module.install.null_resource.setup_snat[0]: Refreshing state... [id=3986268791583832383]
module.install.null_resource.pre_install[0]: Refreshing state... [id=4348901288792704223]
module.install.null_resource.install_config: Refreshing state... [id=3623942564932658546]
module.install.ibm_pi_instance_action.bootstrap_start[0]: Refreshing state... [id=8994821d-cdad-4df8-bf2b-d577a890ac24/rhcos-test-5cce-mon01-bootstrap]
module.install.null_resource.bootstrap_config: Refreshing state... [id=7692104611240558618]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.install.ibm_pi_instance_action.master_start[0] will be created
  + resource "ibm_pi_instance_action" "master_start" {
      + health_status        = (known after apply)
      + id                   = (known after apply)
      + pi_action            = "start"
      + pi_cloud_instance_id = "8994821d-cdad-4df8-bf2b-d577a890ac24"
      + pi_health_status     = "WARNING"
      + pi_instance_id       = "rhcos-test-5cce-mon01-master-0"
      + progress             = (known after apply)
      + status               = (known after apply)
    }

  # module.install.ibm_pi_instance_action.master_start[1] will be created
  + resource "ibm_pi_instance_action" "master_start" {
      + health_status        = (known after apply)
      + id                   = (known after apply)
      + pi_action            = "start"
      + pi_cloud_instance_id = "8994821d-cdad-4df8-bf2b-d577a890ac24"
      + pi_health_status     = "WARNING"
      + pi_instance_id       = "rhcos-test-5cce-mon01-master-1"
      + progress             = (known after apply)
      + status               = (known after apply)
    }

  # module.install.ibm_pi_instance_action.master_start[2] will be created
  + resource "ibm_pi_instance_action" "master_start" {
      + health_status        = (known after apply)
      + id                   = (known after apply)
      + pi_action            = "start"
      + pi_cloud_instance_id = "8994821d-cdad-4df8-bf2b-d577a890ac24"
      + pi_health_status     = "WARNING"
      + pi_instance_id       = "rhcos-test-5cce-mon01-master-2"
      + progress             = (known after apply)
      + status               = (known after apply)
    }

  # module.install.ibm_pi_instance_action.worker_start[0] will be created
  + resource "ibm_pi_instance_action" "worker_start" {
      + health_status        = (known after apply)
      + id                   = (known after apply)
      + pi_action            = "start"
      + pi_cloud_instance_id = "8994821d-cdad-4df8-bf2b-d577a890ac24"
      + pi_health_status     = "WARNING"
      + pi_instance_id       = "rhcos-test-5cce-mon01-worker-0"
      + progress             = (known after apply)
      + status               = (known after apply)
    }

  # module.install.ibm_pi_instance_action.worker_start[1] will be created
  + resource "ibm_pi_instance_action" "worker_start" {
      + health_status        = (known after apply)
      + id                   = (known after apply)
      + pi_action            = "start"
      + pi_cloud_instance_id = "8994821d-cdad-4df8-bf2b-d577a890ac24"
      + pi_health_status     = "WARNING"
      + pi_instance_id       = "rhcos-test-5cce-mon01-worker-1"
      + progress             = (known after apply)
      + status               = (known after apply)
    }

  # module.install.null_resource.bootstrap_complete will be created
  + resource "null_resource" "bootstrap_complete" {
      + id       = (known after apply)
      + triggers = {
          + "worker_count" = "2"
        }
    }

  # module.install.null_resource.bootstrap_config is tainted, so must be replaced
-/+ resource "null_resource" "bootstrap_config" {
      ~ id       = "7692104611240558618" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.install.null_resource.install will be created
  + resource "null_resource" "install" {
      + id       = (known after apply)
      + triggers = {
          + "worker_count" = "2"
        }
    }

Plan: 8 to add, 0 to change, 1 to destroy.
module.install.null_resource.bootstrap_config: Destroying... [id=7692104611240558618]
module.install.null_resource.bootstrap_config: Destruction complete after 1s
module.install.null_resource.bootstrap_config: Creating...
module.install.null_resource.bootstrap_config: Provisioning with 'remote-exec'...
module.install.null_resource.bootstrap_config (remote-exec): Connecting to remote host via SSH...
module.install.null_resource.bootstrap_config (remote-exec):   Host: 169.54.110.125
module.install.null_resource.bootstrap_config (remote-exec):   User: root
module.install.null_resource.bootstrap_config (remote-exec):   Password: false
module.install.null_resource.bootstrap_config (remote-exec):   Private key: true
module.install.null_resource.bootstrap_config (remote-exec):   Certificate: false
module.install.null_resource.bootstrap_config (remote-exec):   SSH Agent: false
module.install.null_resource.bootstrap_config (remote-exec):   Checking Host Key: false
module.install.null_resource.bootstrap_config (remote-exec):   Target Platform: unix
module.install.null_resource.bootstrap_config (remote-exec): Connected!
module.install.null_resource.bootstrap_config (remote-exec): Running ocp bootstrap-config playbook...
module.install.null_resource.bootstrap_config (remote-exec): Using /root/ocp4-playbooks/ansible.cfg as config file

module.install.null_resource.bootstrap_config (remote-exec): PLAY [Check and configure bootstrap node] **************************************

module.install.null_resource.bootstrap_config (remote-exec): TASK [nodes-config : Check connection] *****************************************
module.install.null_resource.bootstrap_config: Still creating... [10s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [20s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [30s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [40s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [50s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [1m0s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [1m10s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [1m20s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [1m30s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [1m40s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [1m50s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [2m0s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [2m10s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [2m20s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [2m30s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [2m40s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [2m50s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [3m0s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [3m10s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [3m20s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [3m30s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [3m40s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [3m50s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [4m0s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [4m10s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [4m20s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [4m30s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [4m40s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [4m50s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [5m0s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [5m10s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [5m20s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [5m30s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [5m40s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [5m50s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [6m0s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [6m10s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [6m20s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [6m30s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [6m40s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [6m50s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [7m0s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [7m10s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [7m20s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [7m30s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [7m40s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [7m50s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [8m0s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [8m10s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [8m20s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [8m30s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [8m40s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [8m50s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [9m0s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [9m10s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [9m20s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [9m30s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [9m40s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [9m50s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [10m0s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [10m10s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [10m20s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [10m30s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [10m40s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [10m50s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [11m0s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [11m10s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [11m20s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [11m30s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [11m40s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [11m50s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [12m0s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [12m10s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [12m20s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [12m30s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [12m40s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [12m50s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [13m0s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [13m10s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [13m20s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [13m30s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [13m40s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [13m50s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [14m0s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [14m10s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [14m20s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [14m30s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [14m40s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [14m50s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [15m0s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [15m10s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [15m20s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [15m30s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [15m40s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [15m50s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [16m0s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [16m10s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [16m20s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [16m30s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [16m40s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [16m50s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [17m0s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [17m10s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [17m20s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [17m30s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [17m40s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [17m50s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [18m0s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [18m10s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [18m20s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [18m30s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [18m40s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [18m50s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [19m0s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [19m10s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [19m20s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [19m30s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [19m40s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [19m50s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [20m0s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [20m10s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [20m20s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [20m30s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [20m40s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [20m50s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [21m0s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [21m10s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [21m20s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [21m30s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [21m40s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [21m50s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [22m0s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [22m10s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [22m20s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [22m30s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [22m40s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [22m50s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [23m0s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [23m10s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [23m20s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [23m30s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [23m40s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [23m50s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [24m0s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [24m10s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [24m20s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [24m30s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [24m40s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [24m50s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [25m0s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [25m10s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [25m20s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [25m30s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [25m40s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [25m50s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [26m0s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [26m10s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [26m20s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [26m30s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [26m40s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [26m50s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [27m0s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [27m10s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [27m20s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [27m30s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [27m40s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [27m50s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [28m0s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [28m10s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [28m20s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [28m30s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [28m40s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [28m50s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [29m0s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [29m10s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [29m20s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [29m30s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [29m40s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [29m50s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [30m0s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [30m10s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [30m20s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [30m30s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [30m40s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [30m50s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [31m0s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [31m10s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [31m20s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [31m30s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [31m40s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [31m50s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [32m0s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [32m10s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [32m20s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [32m30s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [32m40s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [32m50s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [33m0s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [33m10s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [33m20s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [33m30s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [33m40s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [33m50s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [34m0s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [34m10s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [34m20s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [34m30s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [34m40s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [34m50s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [35m0s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [35m10s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [35m20s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [35m30s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [35m40s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [35m50s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [36m0s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [36m10s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [36m20s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [36m30s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [36m40s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [36m50s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [37m0s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [37m10s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [37m20s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [37m30s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [37m40s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [37m50s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [38m0s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [38m10s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [38m20s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [38m30s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [38m40s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [38m50s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [39m0s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [39m10s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [39m20s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [39m30s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [39m40s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [39m50s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [40m0s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [40m10s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [40m20s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [40m30s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [40m40s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [40m50s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [41m0s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [41m10s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [41m20s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [41m30s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [41m40s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [41m50s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [42m0s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [42m10s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [42m20s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [42m30s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [42m40s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [42m50s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [43m0s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [43m10s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [43m20s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [43m30s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [43m40s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [43m50s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [44m0s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [44m10s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [44m20s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [44m30s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [44m40s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [44m50s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [45m0s elapsed]
module.install.null_resource.bootstrap_config: Still creating... [45m10s elapsed]
module.install.null_resource.bootstrap_config (remote-exec): fatal: [mon01-bootstrap]: FAILED! => {"changed": false, "elapsed": 2715, "msg": "timed out waiting for ping module test success: Failed to connect to the host via ssh: ssh: connect to host mon01-bootstrap port 22: Connection refused"}

module.install.null_resource.bootstrap_config (remote-exec): NO MORE HOSTS LEFT *************************************************************

module.install.null_resource.bootstrap_config (remote-exec): PLAY RECAP *********************************************************************
module.install.null_resource.bootstrap_config (remote-exec): mon01-bootstrap            : ok=0    changed=0    unreachable=0    failed=1    skipped=0    rescued=0    ignored=0

╷
│ Warning: Deprecated Resource
│
│   with module.prepare.ibm_pi_network_port.bastion_vip,
│   on modules/1_prepare/prepare.tf line 410, in resource "ibm_pi_network_port" "bastion_vip":
│  410: resource "ibm_pi_network_port" "bastion_vip" {
│
│ Resource ibm_pi_network_port is deprecated. Use ibm_pi_network_port_attach
│ to create & attach a network port to a pvm instance
│
│ (and one more similar warning elsewhere)
╵
╷
│ Error: remote-exec provisioner error
│
│   with module.install.null_resource.bootstrap_config,
│   on modules/5_install/install.tf line 422, in resource "null_resource" "bootstrap_config":
│  422:   provisioner "remote-exec" {
│
│ error executing "/tmp/terraform_1975891135.sh": Process exited with status
│ 2
╵
```